In [122]:
# Student data load 

import pandas as pd

In [123]:
record = pd.read_csv('studentgrade.csv')

record.head()

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence
0,1913357,"Behal, Harry",90,13.0,12.0,NaN
1,1899502,"Chugh, Gursahib Singh",67,7.0,6.0,22.0
2,1895342,"Davinder Singh, Davinder Singh",70,28.0,14.0,12.0
3,1913546,"Devarapu, Mary Keerthi",60,7.0,16.0,16.0
4,1895179,"Dharam, Naresh",55,16.0,5.0,38.0

In [124]:
record.describe()

                 ID     Grades  ConsultationsD1  ConsultationsD2  Hrabsence
count  3.400000e+01  34.000000        33.000000        32.000000  31.000000
mean   1.909819e+06  58.470588         9.454545        10.781250  21.046774
std    7.240526e+03  24.096064         6.694638         5.933689  13.605801
min    1.895123e+06   0.000000         1.000000         1.000000   4.000000
25%    1.913046e+06  48.250000         6.000000         6.000000  12.000000
50%    1.913451e+06  65.500000         9.000000         9.000000  20.000000
75%    1.913574e+06  74.750000        12.000000        16.000000  30.000000
max    1.913599e+06  90.000000        28.000000        25.000000  56.000000

In [125]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 6 columns):
ID                 34 non-null int64
Name               34 non-null object
Grades             34 non-null int64
ConsultationsD1    33 non-null float64
ConsultationsD2    32 non-null float64
Hrabsence          31 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 1.7+ KB

In [128]:
# To count number of missing values also with isnull()

record.isna().sum()

ID                 0
Name               0
Grades             0
ConsultationsD1    1
ConsultationsD2    2
Hrabsence          3
dtype: int64

In [13]:
record.dtypes

ID                   int64
Name                object
Grades               int64
ConsultationsD1    float64
ConsultationsD2    float64
Hrabsence          float64
dtype: object

In [14]:
record.Hrabsence.unique()

array([  nan, 22.  , 12.  , 16.  , 38.  ,  8.  , 20.  , 14.  , 32.  ,
       17.45, 30.  ,  4.  , 56.  ,  6.  , 13.  , 26.  ])

In [15]:
#  Replacing nan (null value with mean value)

record.Hrabsence.fillna(round(record.Hrabsence.mean()), inplace=True)

In [16]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 6 columns):
ID                 34 non-null int64
Name               34 non-null object
Grades             34 non-null int64
ConsultationsD1    33 non-null float64
ConsultationsD2    32 non-null float64
Hrabsence          34 non-null float64
dtypes: float64(3), int64(2), object(1)
memory usage: 1.7+ KB

In [17]:
record.dtypes

ID                   int64
Name                object
Grades               int64
ConsultationsD1    float64
ConsultationsD2    float64
Hrabsence          float64
dtype: object

In [18]:
record.Hrabsence.unique()

array([21.  , 22.  , 12.  , 16.  , 38.  ,  8.  , 20.  , 14.  , 32.  ,
       17.45, 30.  ,  4.  , 56.  ,  6.  , 13.  , 26.  ])

In [19]:
# checking unique values for Consultations values

record.ConsultationsD1.unique()

array([13.,  7., 28., 16.,  8., 10.,  6., 12.,  1.,  9.,  2., 25., 11.,
        4., 24., nan])

In [82]:
# Replacing nan value with mean 
record.ConsultationsD1.fillna(round(record.ConsultationsD1.mean()), inplace=True)

In [83]:
# check the replace nan value with new mean value

record.ConsultationsD1.unique()

array([13.,  7., 28., 16.,  8., 10.,  6., 12.,  1.,  9.,  2., 25., 11.,
        4., 24.])

In [84]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 7 columns):
ID                 34 non-null int64
Name               34 non-null object
Grades             34 non-null int64
ConsultationsD1    34 non-null float64
ConsultationsD2    32 non-null float64
Hrabsence          31 non-null float64
Finalgrades        34 non-null object
dtypes: float64(3), int64(2), object(2)
memory usage: 2.0+ KB

In [95]:
record.ConsultationsD2.unique()

array([12.,  6., 14., 16.,  5.,  9.,  8., 13.,  1.,  7., 17., 25., 19.,
       nan, 24., 10.])

In [96]:
# Replacing nan value with mean
record.ConsultationsD2.fillna(round(record.ConsultationsD2.mean()), inplace=True)

In [97]:
record.ConsultationsD2.unique()

array([12.,  6., 14., 16.,  5.,  9.,  8., 13.,  1.,  7., 17., 25., 19.,
       11., 24., 10.])

In [98]:
record.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 34 entries, 0 to 33
Data columns (total 7 columns):
ID                 34 non-null int64
Name               34 non-null object
Grades             34 non-null int64
ConsultationsD1    34 non-null float64
ConsultationsD2    34 non-null float64
Hrabsence          31 non-null float64
Finalgrades        34 non-null object
dtypes: float64(3), int64(2), object(2)
memory usage: 2.0+ KB

In [99]:
record.loc[(record.ConsultationsD2 < 5)]

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
10,1913598,"Gurwinder Singh, Gurwinder Singh",15,1.0,1.0,32.0,Redo
17,1913406,"Mankaranjeet Kaur, Mankaranjeet Kaur",0,1.0,1.0,56.0,Redo

In [100]:
record.Grades

0     90
1     67
2     70
3     60
4     55
5     65
6     64
7     79
8     70
9     63
10    15
11    60
12    46
13    66
14    79
15    74
16    82
17     0
18    77
19    78
20    74
21    76
22    71
23    27
24    75
25    26
26    88
27    31
28    60
29    41
30    23
31     0
32    71
33    65
Name: Grades, dtype: int64

In [101]:
record.loc[(record.Grades == 0)]

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
17,1913406,"Mankaranjeet Kaur, Mankaranjeet Kaur",0,1.0,1.0,56.0,Redo
31,1913099,"Simerjeet Kaur, Simerjeet Kaur",0,9.0,11.0,56.0,Redo

In [102]:
#creating new column with Finalgrades
record['Finalgrades'] = 'na'

In [103]:
record.head()

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
0,1913357,"Behal, Harry",90,13.0,12.0,NaN,na
1,1899502,"Chugh, Gursahib Singh",67,7.0,6.0,22.0,na
2,1895342,"Davinder Singh, Davinder Singh",70,28.0,14.0,12.0,na
3,1913546,"Devarapu, Mary Keerthi",60,7.0,16.0,16.0,na
4,1895179,"Dharam, Naresh",55,16.0,5.0,38.0,na

In [104]:
# Making grades into categorial variables, finalgrades
record.loc[(record.Grades >= 60 ) & (record.Grades <= 100), 'Finalgrades'] = 'Pass'

In [105]:
record.dtypes

ID                   int64
Name                object
Grades               int64
ConsultationsD1    float64
ConsultationsD2    float64
Hrabsence          float64
Finalgrades         object
dtype: object

In [106]:
record.loc[(record.Grades < 60)]

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
4,1895179,"Dharam, Naresh",55,16.0,5.0,38.0,na
10,1913598,"Gurwinder Singh, Gurwinder Singh",15,1.0,1.0,32.0,na
12,1913581,"Inderpreet Singh, Inderpreet Singh",46,9.0,6.0,12.0,na
17,1913406,"Mankaranjeet Kaur, Mankaranjeet Kaur",0,1.0,1.0,56.0,na
23,1913599,"Patel, Laxit Maheshbhai",27,6.0,6.0,38.0,na
25,1913543,"Patel, Utsav Mukeshkumar",26,9.0,5.0,30.0,na
27,1913589,"Sandhu, Anmolpreet Kaur",31,1.0,11.0,30.0,na
29,1913454,"Shabadpreet Kaur, Shabadpreet Kaur",41,24.0,24.0,20.0,na
30,1913591,"Shah, Raj Jitenbhai",23,10.0,10.0,30.0,na
31,1913099,"Simerjeet Kaur, Simerjeet Kaur",0,9.0,11.0,56.0,na

In [107]:
# Making grades into categorial variables, finalgrades
record.loc[(record.Grades >= 50 ) & (record.Grades <= 59), 'Finalgrades'] = 'Retake'

In [108]:
record.loc[(record.Grades >=50 ) & (record.Grades <= 59)]

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
4,1895179,"Dharam, Naresh",55,16.0,5.0,38.0,Retake

In [109]:
# Making grades into categorial variables, finalgrades
record.loc[(record.Grades >= 0 ) & (record.Grades <= 49), 'Finalgrades'] = 'Redo'

In [110]:
record.loc[(record.Grades >= 0) & (record.Grades <= 49)]

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
10,1913598,"Gurwinder Singh, Gurwinder Singh",15,1.0,1.0,32.0,Redo
12,1913581,"Inderpreet Singh, Inderpreet Singh",46,9.0,6.0,12.0,Redo
17,1913406,"Mankaranjeet Kaur, Mankaranjeet Kaur",0,1.0,1.0,56.0,Redo
23,1913599,"Patel, Laxit Maheshbhai",27,6.0,6.0,38.0,Redo
25,1913543,"Patel, Utsav Mukeshkumar",26,9.0,5.0,30.0,Redo
27,1913589,"Sandhu, Anmolpreet Kaur",31,1.0,11.0,30.0,Redo
29,1913454,"Shabadpreet Kaur, Shabadpreet Kaur",41,24.0,24.0,20.0,Redo
30,1913591,"Shah, Raj Jitenbhai",23,10.0,10.0,30.0,Redo
31,1913099,"Simerjeet Kaur, Simerjeet Kaur",0,9.0,11.0,56.0,Redo

In [112]:
record.Hrabsence.unique()

array([  nan, 22.  , 12.  , 16.  , 38.  ,  8.  , 20.  , 14.  , 32.  ,
       17.45, 30.  ,  4.  , 56.  ,  6.  , 13.  , 26.  ])

In [114]:
record.Hrabsence.fillna(round(record.Hrabsence.mean()), inplace=True)

In [116]:
record.Hrabsence.unique()

array([21.  , 22.  , 12.  , 16.  , 38.  ,  8.  , 20.  , 14.  , 32.  ,
       17.45, 30.  ,  4.  , 56.  ,  6.  , 13.  , 26.  ])

In [117]:
# After data prepration
record

,ID,Name,Grades,ConsultationsD1,ConsultationsD2,Hrabsence,Finalgrades
0,1913357,"Behal, Harry",90,13.0,12.0,21.00,Pass
1,1899502,"Chugh, Gursahib Singh",67,7.0,6.0,22.00,Pass
2,1895342,"Davinder Singh, Davinder Singh",70,28.0,14.0,12.00,Pass
3,1913546,"Devarapu, Mary Keerthi",60,7.0,16.0,16.00,Pass
4,1895179,"Dharam, Naresh",55,16.0,5.0,38.00,Retake
5,1913302,"Dilpreet Singh, Dilpreet Singh",65,8.0,6.0,8.00,Pass
6,1913573,"Ekta, Ekta",64,10.0,9.0,20.00,Pass
7,1895244,"Gill, Dilpreet Kaur",79,7.0,8.0,20.00,Pass
8,1913405,"Gopu, Manisha",70,6.0,6.0,20.00,Pass
9,1913548,"Gundeti, Gokul Reddy",63,12.0,13.0,14.00,Pass
10,1913598,"Gurwinder Singh, Gurwinder Singh",15,1.0,1.0,32.00,Redo
11,1913507,"Hamza, Ameer",60,1.0,7.0,17.45,Pass
12,1913581,"Inderpreet Singh, Inderpreet Singh",46,9.0,6.0,12.00,Redo
13,1913575,"Jobanjeet Singh, Jobanjeet Singh",66,2.0,17.0,30.00,Pass
14,1913031,"Kosaraju, Kalyan",79,25.0,25.0,4.00,Pass
15,1913582,"Kulwinder Singh, Kulwinder Singh",74,6.0,9.0,8.00,Pass
16,1913586,"Manjinder Kaur, Manjinder Kaur",82,8.0,6.0,12.00,Pass
17,1913406,"Mankaranjeet Kaur, Mankaranjeet Kaur",0,1.0,1.0,56.00,Redo
18,1913098,"Manvir Kaur, Manvir Kaur",77,11.0,16.0,6.00,Pass
19,1913036,"Narravula, Lakshmi Spandana",78,4.0,16.0,13.00,Pass
20,1913579,"Navpreet Singh, Navpreet Singh",74,12.0,13.0,6.00,Pass
21,1895123,"Palakeerthi, Anil",76,16.0,17.0,30.00,Pass
22,1895317,"Parminder Singh, Parminder Singh",71,12.0,16.0,21.00,Pass
23,1913599,"Patel, Laxit Maheshbhai",27,6.0,6.0,38.00,Redo
24,1913448,"Patel, Rushi Kanubhai",75,12.0,19.0,6.00,Pass
25,1913543,"Patel, Utsav Mukeshkumar",26,9.0,5.0,30.00,Redo
26,1913537,"Prajapati, Riyaben Jagdishchandra",88,7.0,9.0,21.00,Pass
27,1913589,"Sandhu, Anmolpreet Kaur",31,1.0,11.0,30.00,Redo
28,1913078,"Sarasani, Srujal Reddy",60,1.0,9.0,26.00,Pass
29,1913454,"Shabadpreet Kaur, Shabadpreet Kaur",41,24.0,24.0,20.00,Redo
30,1913591,"Shah, Raj Jitenbhai",23,10.0,10.0,30.00,Redo
31,1913099,"Simerjeet Kaur, Simerjeet Kaur",0,9.0,11.0,56.00,Redo
32,1913460,"Tejpal, Shubham",71,9.0,8.0,6.00,Pass
33,1895424,"Thakur, Risabh",65,11.0,10.0,14.00,Pass